sample_app 3-11finish/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2020-06-14 02:42:37.621841"], ["updated_at", "2020-06-14 02:42:37.621841"]]
---
    def create
        # ストロングパラメーターを使用
        list = List.new(list_params)
        # DBへ保存する
        list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "投稿すると"], ["body", "a"], ["updated_at", "2020-06-14 10:13:39.066200"], ["id", 1]]
---
    def update
    	list = List.find(params[:id])
        list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
    def destroy
    	list = List.find(params[:id]) #データ(レコード)を1件取得
        list.destroy #データ（レコード）を削除