sample_app 3-5finish/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2020-06-14 02:42:37.621841"], ["updated_at", "2020-06-14 02:42:37.621841"]]
---
    def create
        # ストロングパラメーターを使用
        list = List.new(list_params)
        # DBへ保存する
        list.save